; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c2-s2-p5-a1)
(:domain logistics-strips)
(:objects a0 
          c0 c1 
          t0 t1 
          l0-0 l0-1 l1-0 l1-1 
          p0 p1 p2 p3 p4 
)
(:init
    (AIRPLANE a0)
    (CITY c0)
    (CITY c1)
    (TRUCK t0)
    (TRUCK t1)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (at t0 l0-0)
    (at t1 l1-0)
    (at p0 l1-0)
    (at p1 l1-0)
    (at p2 l0-1)
    (at p3 l0-0)
    (at p4 l0-1)
    (at a0 l1-0)
)
(:goal
    (and
        (at p0 l1-1)
        (at p1 l1-0)
        (at p2 l0-0)
        (at p3 l0-1)
        (at p4 l1-1)
    )
)
)

; plan
1. (load-truck p0 t1 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 t1)
   goals met: 1 of 5
2. (load-truck p3 t0 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 t0)
   goals met: 1 of 5
3. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 1 of 5
4. (load-truck p4 t0 l0-1)
   deleted: (at p4 l0-1)
   added: (in p4 t0)
   goals met: 1 of 5
5. (unload-truck p3 t0 l0-1)
   deleted: (in p3 t0)
   added: (at p3 l0-1)
   goals met: 2 of 5
6. (load-truck p2 t0 l0-1)
   deleted: (at p2 l0-1)
   added: (in p2 t0)
   goals met: 2 of 5
7. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 2 of 5
8. (unload-truck p4 t0 l0-0)
   deleted: (in p4 t0)
   added: (at p4 l0-0)
   goals met: 2 of 5
9. (unload-truck p2 t0 l0-0)
   deleted: (in p2 t0)
   added: (at p2 l0-0)
   goals met: 3 of 5
10. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 3 of 5
11. (load-airplane p4 a0 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 a0)
   goals met: 3 of 5
12. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 3 of 5
13. (unload-airplane p4 a0 l1-0)
   deleted: (in p4 a0)
   added: (at p4 l1-0)
   goals met: 3 of 5
14. (load-truck p4 t1 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 t1)
   goals met: 3 of 5
15. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 3 of 5
16. (unload-truck p4 t1 l1-1)
   deleted: (in p4 t1)
   added: (at p4 l1-1)
   goals met: 4 of 5
17. (unload-truck p0 t1 l1-1)
   deleted: (in p0 t1)
   added: (at p0 l1-1)
   goals met: 5 of 5
